graph(%self : __torch__.ScriptableAdapter,
      %inputs.1 : (Dict(str, Tensor))):
  %2 : bool = prim::Constant[value=1]() # src/export_model.py:86:23
  %3 : None = prim::Constant()
  %4 : bool = prim::Constant[value=0]() # src/export_model.py:85:72
  %5 : __torch__.detectron2.modeling.meta_arch.rcnn.GeneralizedRCNN = prim::GetAttr[name="model"](%self)
  %6 : Dict(str, Tensor) = prim::TupleUnpack(%inputs.1)
  %7 : Dict(str, Tensor)[] = prim::ListConstruct(%6)
  %15 : str = prim::Constant[value="Empty Instances does not support __len__!"]() # /tmp/detectron2vmennprg/tmp68ws7m9z.py:173:34
  %16 : str = prim::Constant[value="unequal value, x[0] batch dim 0 is {}, but box_list has length {}"]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/poolers.py:213:11
  %17 : str = prim::Constant[value="unequal value, num_level_assignments={}, but x is list of {} Tensors"]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/poolers.py:207:11
  %18 : float = prim::Constant[value=1e-08]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/poolers.py:53:70
  %19 : str = prim::Constant[value="AssertionError: The boxes tensor shape is not correct as Tensor[K, 5]"]()
  %20 : str = prim::Constant[value="AssertionError: proposal_boxes is None and cannot be accessed!"]()
  %21 : int = prim::Constant[value=6]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/anchor_generator.py:42:65
  %22 : str = prim::Constant[value="Indexing on Boxes with {} failed to return a matrix!"]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/boxes.py:234:29
  %23 : str = prim::Constant[value="AssertionError: Box tensor contains infinite or NaN!"]()
  %24 : int = prim::Constant[value=40000]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/nms.py:19:20
  %25 : int = prim::Constant[value=11]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/nms.py:23:56
  %26 : (str, str, str, str, str, str, str, str) = prim::Constant[value=("proposal_boxes", "objectness_logits", "pred_boxes", "scores", "pred_classes", "pred_masks", "pred_keypoints", "pred_keypoint_heatmaps")]()
  %27 : float = prim::Constant[value=0.5]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/box_regression.py:93:30
  %28 : int = prim::Constant[value=-4]()
  %29 : int = prim::Constant[value=-3]()
  %30 : str = prim::Constant[value="nearest"]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/fpn.py:140:88
  %31 : float = prim::Constant[value=2.]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/fpn.py:140:78
  %32 : int = prim::Constant[value=3]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:358:40
  %33 : float = prim::Constant[value=0.10000000000000001]()
  %34 : str = prim::Constant[value="ResNet takes an input of shape (N, C, H, W). Got {} instead!"]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:29
  %35 : str = prim::Constant[value="stem"]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:446:11
  %36 : str = prim::Constant[value="area"]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:3443:27
  %37 : str = prim::Constant[value="Default upsampling behavior when mode={} is changed to align_corners=False since 0.4.0. Please specify align_corners=True if the old behavior is desired. See the documentation of nn.Upsample for details."]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:3452:16
  %38 : int = prim::Constant[value=9223372036854775807]()
  %39 : str = prim::Constant[value="The default behavior for interpolate/upsample with float scale_factor changed in 1.6.0 to align with other frameworks/libraries, and now uses scale_factor directly, instead of relying on the computed output size. If you wish to restore the old behavior, please set recompute_scale_factor=True. See the documentation of nn.Upsample for details. "]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:3500:24
  %40 : int = prim::Constant[value=5]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:3533:22
  %41 : str = prim::Constant[value="Input Error: Only 3D, 4D and 5D input Tensors supported (got {}D) for the modes: nearest | linear | bilinear | bicubic | trilinear (got {})"]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:3573:8
  %42 : float = prim::Constant[value=0.]()
  %43 : int = prim::Constant[value=1]()
  %44 : bool = prim::Constant[value=0]()
  %45 : str = prim::Constant[value="image"]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:224:20
  %46 : int = prim::Constant[value=2]()
  %47 : str = prim::Constant[value="AssertionError: Padding length too large"]()
  %48 : int = prim::Constant[value=0]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:75:30
  %49 : str = prim::Constant[value="AssertionError: "]()
  %50 : int = prim::Constant[value=-2]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:79:28
  %51 : int = prim::Constant[value=-1]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:81:47
  %52 : int = prim::Constant[value=4]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:92:52
  %53 : None = prim::Constant() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:202:33
  %54 : bool = prim::Constant[value=1]() # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:211:33
  %55 : str = prim::Constant[value="AssertionError: Scripting is not supported for postprocess."]()
  %56 : __torch__.detectron2.export.torchscript_patch1.ScriptedInstances1[] = prim::Uninitialized()
  %images.1 : Tensor[] = prim::ListConstruct()
  %58 : int = aten::len(%7) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:224:17
   = prim::Loop(%58, %54) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:224:17
    block0(%59 : int):
      %x.123 : Dict(str, Tensor) = aten::__getitem__(%7, %59) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:224:17
      %61 : Tensor = aten::__getitem__(%x.123, %45) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:224:18
      %62 : Tensor = prim::GetAttr[name="pixel_mean"](%5)
      %63 : Device = prim::device(%62)
      %64 : Tensor = aten::to(%61, %63, %53, %44, %44) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:224:18
      %65 : Tensor[] = aten::append(%images.1, %64) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:224:17
      -> (%54)
  %images.3 : Tensor[] = prim::ListConstruct()
  %67 : int = aten::len(%images.1) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:225:17
   = prim::Loop(%67, %54) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:225:17
    block0(%68 : int):
      %x.119 : Tensor = aten::__getitem__(%images.1, %68) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:225:17
      %70 : Tensor = prim::GetAttr[name="pixel_mean"](%5)
      %71 : Tensor = aten::sub(%x.119, %70, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:225:19
      %72 : Tensor = prim::GetAttr[name="pixel_std"](%5)
      %73 : Tensor = aten::div(%71, %72) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:225:19
      %74 : Tensor[] = aten::append(%images.3, %73) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:225:17
      -> (%54)
  %75 : __torch__.detectron2.modeling.backbone.fpn.FPN = prim::GetAttr[name="backbone"](%5)
  %76 : int = prim::GetAttr[name="_size_divisibility"](%75)
  %77 : int = aten::len(%images.3) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:75:15
  %78 : bool = aten::gt(%77, %48) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:75:15
   = prim::If(%78) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:75:8
    block0():
      -> ()
    block1():
       = prim::RaiseException(%49) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:75:8
      -> ()
  %79 : int = aten::len(%images.3) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:77:8
   = prim::Loop(%79, %54) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:77:8
    block0(%80 : int):
      %t.12 : Tensor = aten::__getitem__(%images.3, %80) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:77:8
      %82 : int[] = aten::size(%t.12) # <string>:7:9
      %83 : int[] = aten::slice(%82, %48, %50, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:79:19
      %84 : Tensor = aten::__getitem__(%images.3, %48) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:79:35
      %85 : int[] = aten::size(%84) # <string>:7:9
      %86 : int[] = aten::slice(%85, %48, %50, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:79:35
      %87 : bool = aten::eq(%83, %86) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:79:19
       = prim::If(%87) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:79:12
        block0():
          -> ()
        block1():
          %88 : int[] = aten::size(%t.12) # <string>:7:9
          %89 : str = aten::str(%88) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:79:12
          %90 : str = aten::add(%49, %89) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:79:12
           = prim::RaiseException(%90) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:79:12
          -> ()
      -> (%54)
  %image_sizes.1 : (int, int)[] = prim::ListConstruct()
  %92 : int = aten::len(%images.3) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:81:22
   = prim::Loop(%92, %54) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:81:22
    block0(%93 : int):
      %im.1 : Tensor = aten::__getitem__(%images.3, %93) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:81:22
      %95 : int[] = aten::size(%im.1) # <string>:7:9
      %96 : int = aten::__getitem__(%95, %50) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:81:24
      %97 : int[] = aten::size(%im.1) # <string>:7:9
      %98 : int = aten::__getitem__(%97, %51) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:81:38
      %99 : (int, int) = prim::TupleConstruct(%96, %98)
      %100 : (int, int)[] = aten::append(%image_sizes.1, %99) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:81:22
      -> (%54)
  %image_sizes_tensor.1 : Tensor[] = prim::ListConstruct()
  %102 : int = aten::len(%image_sizes.1) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:82:29
   = prim::Loop(%102, %54) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:82:29
    block0(%103 : int):
      %x.121 : (int, int) = aten::__getitem__(%image_sizes.1, %103) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:82:29
      %105 : int, %106 : int = prim::TupleUnpack(%x.121)
      %107 : int[] = prim::ListConstruct(%105, %106)
      %108 : Tensor = aten::as_tensor(%107, %53, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/wrappers.py:25:15
      %109 : Tensor[] = aten::append(%image_sizes_tensor.1, %108) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:82:29
      -> (%54)
  %110 : Tensor = aten::stack(%image_sizes_tensor.1, %48) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:83:19
  %111 : Tensor, %112 : Tensor = aten::max(%110, %48, %44) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:83:19
  %113 : bool = aten::gt(%76, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:85:11
  %max_size : Tensor = prim::If(%113) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:85:8
    block0():
      %115 : int = aten::sub(%76, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:88:36
      %116 : Tensor = aten::add(%111, %115, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:88:24
      %117 : Tensor = aten::floor_divide(%116, %76) # <string>:3:9
      %max_size.3 : Tensor = aten::mul(%117, %76) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:88:24
      -> (%max_size.3)
    block1():
      -> (%111)
  %119 : Tensor = aten::to(%max_size, %52, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:92:34
  %max_size.10 : int[] = prim::tolist(%119, %43, %48)
  %121 : int = aten::len(%images.3) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:97:11
  %122 : bool = aten::eq(%121, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:97:11
  %batched_imgs : Tensor = prim::If(%122) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:97:8
    block0():
      %image_size.2 : (int, int) = aten::__getitem__(%image_sizes.1, %48) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:100:25
      %125 : int = aten::__getitem__(%max_size.10, %51) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:101:31
      %126 : int = prim::TupleIndex(%image_size.2, %43)
      %127 : int = aten::sub(%125, %126) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:101:31
      %128 : int = aten::__getitem__(%max_size.10, %50) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:101:64
      %129 : int = prim::TupleIndex(%image_size.2, %48)
      %130 : int = aten::sub(%128, %129) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:101:64
      %padding_size.1 : int[] = prim::ListConstruct(%48, %127, %48, %130)
      %132 : Tensor = aten::__getitem__(%images.3, %48) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:102:33
      %133 : int = aten::dim(%132) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:3995:28
      %134 : bool = aten::le(%46, %133) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:3995:11
       = prim::If(%134) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:3995:4
        block0():
          -> ()
        block1():
           = prim::RaiseException(%47) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:3995:4
          -> ()
      %135 : Tensor = aten::constant_pad_nd(%132, %padding_size.1, %42) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:3997:15
      %batched_imgs.1 : Tensor = aten::unsqueeze_(%135, %48) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:102:27
      -> (%batched_imgs.1)
    block1():
      %137 : int = aten::len(%images.3) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:105:27
      %138 : int[] = prim::ListConstruct(%137)
      %139 : Tensor = aten::__getitem__(%images.3, %48) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:105:48
      %140 : int[] = aten::size(%139) # <string>:7:9
      %141 : int[] = aten::slice(%140, %48, %50, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:105:48
      %142 : int[] = aten::list(%141) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:105:43
      %143 : int[] = aten::add(%138, %142) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:105:26
      %144 : int[] = aten::list(%max_size.10) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:105:73
      %batch_shape.1 : int[] = aten::add(%143, %144) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:105:26
      %146 : Tensor = aten::__getitem__(%images.3, %48) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:106:27
      %batched_imgs.2 : Tensor = aten::new_full(%146, %batch_shape.1, %42, %53, %53, %53, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:106:27
      %148 : int = aten::len(%images.3) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:107:12
      %149 : int = aten::len(%batched_imgs.2) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:107:12
      %150 : int[] = prim::ListConstruct(%148, %149)
      %151 : int = prim::min(%150) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:107:12
       = prim::Loop(%151, %54) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:107:12
        block0(%152 : int):
          %img.1 : Tensor = aten::__getitem__(%images.3, %152) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:107:12
          %pad_img.1 : Tensor = aten::select(%batched_imgs.2, %48, %152) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:107:12
          %155 : int[] = aten::size(%img.1) # <string>:7:9
          %156 : int = aten::__getitem__(%155, %50) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:108:31
          %157 : Tensor = aten::slice(%pad_img.1, %50, %48, %156, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:108:16
          %158 : int[] = aten::size(%img.1) # <string>:7:9
          %159 : int = aten::__getitem__(%158, %51) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:108:48
          %160 : Tensor = aten::slice(%157, %51, %48, %159, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:108:16
          %161 : Tensor = aten::copy_(%160, %img.1, %44) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:108:16
          -> (%54)
      -> (%batched_imgs.2)
  %162 : Tensor = aten::contiguous(%batched_imgs, %48) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/structures/image_list.py:110:25
  %images.2 : __torch__.detectron2.structures.image_list.ImageList = prim::CreateObject()
   = prim::SetAttr[name="tensor"](%images.2, %162)
   = prim::SetAttr[name="image_sizes"](%images.2, %image_sizes.1)
  %164 : __torch__.detectron2.modeling.backbone.fpn.FPN = prim::GetAttr[name="backbone"](%5)
  %165 : Tensor = prim::GetAttr[name="tensor"](%images.2)
  %166 : __torch__.detectron2.modeling.backbone.resnet.ResNet = prim::GetAttr[name="bottom_up"](%164)
  %167 : int = aten::dim(%165) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:15
  %168 : bool = aten::eq(%167, %52) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:15
   = prim::If(%168) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:8
    block0():
      -> ()
    block1():
      %169 : int[] = aten::size(%165) # <string>:7:9
      %170 : str = aten::format(%34, %169) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:29
      %171 : str = aten::add(%49, %170) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:8
       = prim::RaiseException(%171) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:8
      -> ()
  %bottom_up_features.1 : Dict(str, Tensor) = prim::DictConstruct()
  %173 : __torch__.detectron2.modeling.backbone.resnet.BasicStem = prim::GetAttr[name="stem"](%166)
  %174 : __torch__.detectron2.layers.wrappers.Conv2d = prim::GetAttr[name="conv1"](%173)
  %175 : Tensor = prim::GetAttr[name="weight"](%174)
  %176 : Tensor? = prim::GetAttr[name="bias"](%174)
  %177 : int[] = prim::ListConstruct(%46, %46)
  %178 : int[] = prim::ListConstruct(%32, %32)
  %179 : int[] = prim::ListConstruct(%43, %43)
  %x.76 : Tensor = aten::conv2d(%165, %175, %176, %177, %178, %179, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/wrappers.py:106:12
  %181 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%174)
  %182 : bool = prim::requires_grad(%x.76)
  %x.74 : Tensor = prim::If(%182) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:45:8
    block0():
      %184 : Tensor = prim::GetAttr[name="weight"](%181)
      %185 : Tensor = prim::GetAttr[name="running_var"](%181)
      %186 : float = prim::GetAttr[name="eps"](%181)
      %187 : Tensor = aten::add(%185, %186, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %188 : Tensor = aten::rsqrt(%187) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %scale.163 : Tensor = aten::mul(%184, %188) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:20
      %190 : Tensor = prim::GetAttr[name="bias"](%181)
      %191 : Tensor = prim::GetAttr[name="running_mean"](%181)
      %192 : Tensor = aten::mul(%191, %scale.163) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:31
      %bias.163 : Tensor = aten::sub(%190, %192, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:19
      %194 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.164 : Tensor = aten::reshape(%scale.163, %194) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:50:20
      %196 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.164 : Tensor = aten::reshape(%bias.163, %196) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:51:19
      %out_dtype.82 : int = prim::dtype(%x.76)
      %199 : Tensor = aten::to(%scale.164, %out_dtype.82, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:23
      %200 : Tensor = aten::mul(%x.76, %199) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      %201 : Tensor = aten::to(%bias.164, %out_dtype.82, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:45
      %202 : Tensor = aten::add(%200, %201, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      -> (%202)
    block1():
      %203 : Tensor = prim::GetAttr[name="running_mean"](%181)
      %204 : Tensor = prim::GetAttr[name="running_var"](%181)
      %205 : Tensor = prim::GetAttr[name="weight"](%181)
      %206 : Tensor = prim::GetAttr[name="bias"](%181)
      %207 : float = prim::GetAttr[name="eps"](%181)
      %208 : Tensor = aten::batch_norm(%x.76, %205, %206, %203, %204, %44, %33, %207, %54) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:2146:11
      -> (%208)
  %x.75 : Tensor = aten::relu_(%x.74) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:357:12
  %210 : int[] = prim::ListConstruct(%32, %32)
  %211 : int[] = prim::ListConstruct(%46, %46)
  %212 : int[] = prim::ListConstruct(%43, %43)
  %213 : int[] = prim::ListConstruct(%43, %43)
  %x.84 : Tensor = aten::max_pool2d(%x.75, %210, %211, %212, %213, %44) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:659:11
  %215 : str[] = prim::GetAttr[name="_out_features"](%166)
  %216 : bool = aten::__contains__(%215, %35) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:446:11
   = prim::If(%216) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:446:8
    block0():
       = aten::_set_item(%bottom_up_features.1, %35, %x.84) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:447:12
      -> ()
    block1():
      -> ()
  %217 : (str, str, str, str) = prim::GetAttr[name="stage_names"](%166)
  %name.1 : str, %name.4 : str, %name.7 : str, %name.10 : str = prim::TupleUnpack(%217)
  %222 : __torch__.torch.nn.modules.container.ModuleList = prim::GetAttr[name="stages"](%166)
  %223 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="0"](%222)
  %224 : __torch__.torch.nn.modules.container.___torch_mangle_12.Sequential = prim::GetAttr[name="1"](%222)
  %225 : __torch__.torch.nn.modules.container.___torch_mangle_20.Sequential = prim::GetAttr[name="2"](%222)
  %226 : __torch__.torch.nn.modules.container.___torch_mangle_28.Sequential = prim::GetAttr[name="3"](%222)
  %227 : __torch__.detectron2.modeling.backbone.resnet.BottleneckBlock = prim::GetAttr[name="0"](%223)
  %228 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_4.BottleneckBlock = prim::GetAttr[name="1"](%223)
  %229 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_4.BottleneckBlock = prim::GetAttr[name="2"](%223)
  %230 : __torch__.detectron2.layers.wrappers.___torch_mangle_1.Conv2d = prim::GetAttr[name="conv1"](%227)
  %231 : Tensor = prim::GetAttr[name="weight"](%230)
  %232 : Tensor? = prim::GetAttr[name="bias"](%230)
  %233 : int[] = prim::ListConstruct(%43, %43)
  %234 : int[] = prim::ListConstruct(%48, %48)
  %235 : int[] = prim::ListConstruct(%43, %43)
  %x.77 : Tensor = aten::conv2d(%x.84, %231, %232, %233, %234, %235, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/wrappers.py:106:12
  %237 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%230)
  %238 : bool = prim::requires_grad(%x.77)
  %out.13 : Tensor = prim::If(%238) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:45:8
    block0():
      %240 : Tensor = prim::GetAttr[name="weight"](%237)
      %241 : Tensor = prim::GetAttr[name="running_var"](%237)
      %242 : float = prim::GetAttr[name="eps"](%237)
      %243 : Tensor = aten::add(%241, %242, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %244 : Tensor = aten::rsqrt(%243) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %scale.165 : Tensor = aten::mul(%240, %244) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:20
      %246 : Tensor = prim::GetAttr[name="bias"](%237)
      %247 : Tensor = prim::GetAttr[name="running_mean"](%237)
      %248 : Tensor = aten::mul(%247, %scale.165) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:31
      %bias.165 : Tensor = aten::sub(%246, %248, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:19
      %250 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.166 : Tensor = aten::reshape(%scale.165, %250) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:50:20
      %252 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.166 : Tensor = aten::reshape(%bias.165, %252) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:51:19
      %out_dtype.83 : int = prim::dtype(%x.77)
      %255 : Tensor = aten::to(%scale.166, %out_dtype.83, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:23
      %256 : Tensor = aten::mul(%x.77, %255) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      %257 : Tensor = aten::to(%bias.166, %out_dtype.83, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:45
      %258 : Tensor = aten::add(%256, %257, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      -> (%258)
    block1():
      %259 : Tensor = prim::GetAttr[name="running_mean"](%237)
      %260 : Tensor = prim::GetAttr[name="running_var"](%237)
      %261 : Tensor = prim::GetAttr[name="weight"](%237)
      %262 : Tensor = prim::GetAttr[name="bias"](%237)
      %263 : float = prim::GetAttr[name="eps"](%237)
      %264 : Tensor = aten::batch_norm(%x.77, %261, %262, %259, %260, %44, %33, %263, %54) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:2146:11
      -> (%264)
  %out.140 : Tensor = aten::relu_(%out.13) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:196:14
  %266 : __torch__.detectron2.layers.wrappers.___torch_mangle_2.Conv2d = prim::GetAttr[name="conv2"](%227)
  %267 : Tensor = prim::GetAttr[name="weight"](%266)
  %268 : Tensor? = prim::GetAttr[name="bias"](%266)
  %269 : int[] = prim::ListConstruct(%43, %43)
  %270 : int[] = prim::ListConstruct(%43, %43)
  %271 : int[] = prim::ListConstruct(%43, %43)
  %x.78 : Tensor = aten::conv2d(%out.140, %267, %268, %269, %270, %271, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/wrappers.py:106:12
  %273 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%266)
  %274 : bool = prim::requires_grad(%x.78)
  %out.141 : Tensor = prim::If(%274) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:45:8
    block0():
      %276 : Tensor = prim::GetAttr[name="weight"](%273)
      %277 : Tensor = prim::GetAttr[name="running_var"](%273)
      %278 : float = prim::GetAttr[name="eps"](%273)
      %279 : Tensor = aten::add(%277, %278, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %280 : Tensor = aten::rsqrt(%279) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %scale.167 : Tensor = aten::mul(%276, %280) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:20
      %282 : Tensor = prim::GetAttr[name="bias"](%273)
      %283 : Tensor = prim::GetAttr[name="running_mean"](%273)
      %284 : Tensor = aten::mul(%283, %scale.167) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:31
      %bias.167 : Tensor = aten::sub(%282, %284, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:19
      %286 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.168 : Tensor = aten::reshape(%scale.167, %286) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:50:20
      %288 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.168 : Tensor = aten::reshape(%bias.167, %288) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:51:19
      %out_dtype.84 : int = prim::dtype(%x.78)
      %291 : Tensor = aten::to(%scale.168, %out_dtype.84, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:23
      %292 : Tensor = aten::mul(%x.78, %291) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      %293 : Tensor = aten::to(%bias.168, %out_dtype.84, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:45
      %294 : Tensor = aten::add(%292, %293, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      -> (%294)
    block1():
      %295 : Tensor = prim::GetAttr[name="running_mean"](%273)
      %296 : Tensor = prim::GetAttr[name="running_var"](%273)
      %297 : Tensor = prim::GetAttr[name="weight"](%273)
      %298 : Tensor = prim::GetAttr[name="bias"](%273)
      %299 : float = prim::GetAttr[name="eps"](%273)
      %300 : Tensor = aten::batch_norm(%x.78, %297, %298, %295, %296, %44, %33, %299, %54) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:2146:11
      -> (%300)
  %out.142 : Tensor = aten::relu_(%out.141) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:199:14
  %302 : __torch__.detectron2.layers.wrappers.___torch_mangle_0.Conv2d = prim::GetAttr[name="conv3"](%227)
  %303 : Tensor = prim::GetAttr[name="weight"](%302)
  %304 : Tensor? = prim::GetAttr[name="bias"](%302)
  %305 : int[] = prim::ListConstruct(%43, %43)
  %306 : int[] = prim::ListConstruct(%48, %48)
  %307 : int[] = prim::ListConstruct(%43, %43)
  %x.79 : Tensor = aten::conv2d(%out.142, %303, %304, %305, %306, %307, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/wrappers.py:106:12
  %309 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%302)
  %310 : bool = prim::requires_grad(%x.79)
  %out.143 : Tensor = prim::If(%310) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:45:8
    block0():
      %312 : Tensor = prim::GetAttr[name="weight"](%309)
      %313 : Tensor = prim::GetAttr[name="running_var"](%309)
      %314 : float = prim::GetAttr[name="eps"](%309)
      %315 : Tensor = aten::add(%313, %314, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %316 : Tensor = aten::rsqrt(%315) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %scale.153 : Tensor = aten::mul(%312, %316) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:20
      %318 : Tensor = prim::GetAttr[name="bias"](%309)
      %319 : Tensor = prim::GetAttr[name="running_mean"](%309)
      %320 : Tensor = aten::mul(%319, %scale.153) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:31
      %bias.153 : Tensor = aten::sub(%318, %320, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:19
      %322 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.154 : Tensor = aten::reshape(%scale.153, %322) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:50:20
      %324 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.154 : Tensor = aten::reshape(%bias.153, %324) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:51:19
      %out_dtype.77 : int = prim::dtype(%x.79)
      %327 : Tensor = aten::to(%scale.154, %out_dtype.77, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:23
      %328 : Tensor = aten::mul(%x.79, %327) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      %329 : Tensor = aten::to(%bias.154, %out_dtype.77, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:45
      %330 : Tensor = aten::add(%328, %329, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      -> (%330)
    block1():
      %331 : Tensor = prim::GetAttr[name="running_mean"](%309)
      %332 : Tensor = prim::GetAttr[name="running_var"](%309)
      %333 : Tensor = prim::GetAttr[name="weight"](%309)
      %334 : Tensor = prim::GetAttr[name="bias"](%309)
      %335 : float = prim::GetAttr[name="eps"](%309)
      %336 : Tensor = aten::batch_norm(%x.79, %333, %334, %331, %332, %44, %33, %335, %54) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:2146:11
      -> (%336)
  %337 : __torch__.detectron2.layers.wrappers.___torch_mangle_0.Conv2d = prim::GetAttr[name="shortcut"](%227)
  %338 : Tensor = prim::GetAttr[name="weight"](%337)
  %339 : Tensor? = prim::GetAttr[name="bias"](%337)
  %340 : int[] = prim::ListConstruct(%43, %43)
  %341 : int[] = prim::ListConstruct(%48, %48)
  %342 : int[] = prim::ListConstruct(%43, %43)
  %x.80 : Tensor = aten::conv2d(%x.84, %338, %339, %340, %341, %342, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/wrappers.py:106:12
  %344 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%337)
  %345 : bool = prim::requires_grad(%x.80)
  %shortcut.2 : Tensor = prim::If(%345) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:45:8
    block0():
      %347 : Tensor = prim::GetAttr[name="weight"](%344)
      %348 : Tensor = prim::GetAttr[name="running_var"](%344)
      %349 : float = prim::GetAttr[name="eps"](%344)
      %350 : Tensor = aten::add(%348, %349, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %351 : Tensor = aten::rsqrt(%350) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %scale.155 : Tensor = aten::mul(%347, %351) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:20
      %353 : Tensor = prim::GetAttr[name="bias"](%344)
      %354 : Tensor = prim::GetAttr[name="running_mean"](%344)
      %355 : Tensor = aten::mul(%354, %scale.155) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:31
      %bias.155 : Tensor = aten::sub(%353, %355, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:19
      %357 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.156 : Tensor = aten::reshape(%scale.155, %357) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:50:20
      %359 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.156 : Tensor = aten::reshape(%bias.155, %359) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:51:19
      %out_dtype.78 : int = prim::dtype(%x.80)
      %362 : Tensor = aten::to(%scale.156, %out_dtype.78, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:23
      %363 : Tensor = aten::mul(%x.80, %362) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      %364 : Tensor = aten::to(%bias.156, %out_dtype.78, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:45
      %365 : Tensor = aten::add(%363, %364, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      -> (%365)
    block1():
      %366 : Tensor = prim::GetAttr[name="running_mean"](%344)
      %367 : Tensor = prim::GetAttr[name="running_var"](%344)
      %368 : Tensor = prim::GetAttr[name="weight"](%344)
      %369 : Tensor = prim::GetAttr[name="bias"](%344)
      %370 : float = prim::GetAttr[name="eps"](%344)
      %371 : Tensor = aten::batch_norm(%x.80, %368, %369, %366, %367, %44, %33, %370, %54) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:2146:11
      -> (%371)
  %out.144 : Tensor = aten::add_(%out.143, %shortcut.2, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:208:8
  %input.28 : Tensor = aten::relu_(%out.144) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:209:14
  %374 : __torch__.detectron2.layers.wrappers.___torch_mangle_3.Conv2d = prim::GetAttr[name="conv1"](%228)
  %375 : Tensor = prim::GetAttr[name="weight"](%374)
  %376 : Tensor? = prim::GetAttr[name="bias"](%374)
  %377 : int[] = prim::ListConstruct(%43, %43)
  %378 : int[] = prim::ListConstruct(%48, %48)
  %379 : int[] = prim::ListConstruct(%43, %43)
  %x.81 : Tensor = aten::conv2d(%input.28, %375, %376, %377, %378, %379, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/wrappers.py:106:12
  %381 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%374)
  %382 : bool = prim::requires_grad(%x.81)
  %out.151 : Tensor = prim::If(%382) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:45:8
    block0():
      %384 : Tensor = prim::GetAttr[name="weight"](%381)
      %385 : Tensor = prim::GetAttr[name="running_var"](%381)
      %386 : float = prim::GetAttr[name="eps"](%381)
      %387 : Tensor = aten::add(%385, %386, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %388 : Tensor = aten::rsqrt(%387) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %scale.157 : Tensor = aten::mul(%384, %388) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:20
      %390 : Tensor = prim::GetAttr[name="bias"](%381)
      %391 : Tensor = prim::GetAttr[name="running_mean"](%381)
      %392 : Tensor = aten::mul(%391, %scale.157) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:31
      %bias.157 : Tensor = aten::sub(%390, %392, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:19
      %394 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.158 : Tensor = aten::reshape(%scale.157, %394) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:50:20
      %396 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.158 : Tensor = aten::reshape(%bias.157, %396) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:51:19
      %out_dtype.79 : int = prim::dtype(%x.81)
      %399 : Tensor = aten::to(%scale.158, %out_dtype.79, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:23
      %400 : Tensor = aten::mul(%x.81, %399) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      %401 : Tensor = aten::to(%bias.158, %out_dtype.79, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:45
      %402 : Tensor = aten::add(%400, %401, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      -> (%402)
    block1():
      %403 : Tensor = prim::GetAttr[name="running_mean"](%381)
      %404 : Tensor = prim::GetAttr[name="running_var"](%381)
      %405 : Tensor = prim::GetAttr[name="weight"](%381)
      %406 : Tensor = prim::GetAttr[name="bias"](%381)
      %407 : float = prim::GetAttr[name="eps"](%381)
      %408 : Tensor = aten::batch_norm(%x.81, %405, %406, %403, %404, %44, %33, %407, %54) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/torch/nn/functional.py:2146:11
      -> (%408)
  %out.170 : Tensor = aten::relu_(%out.151) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:196:14
  %410 : __torch__.detectron2.layers.wrappers.___torch_mangle_2.Conv2d = prim::GetAttr[name="conv2"](%228)
  %411 : Tensor = prim::GetAttr[name="weight"](%410)
  %412 : Tensor? = prim::GetAttr[name="bias"](%410)
  %413 : int[] = prim::ListConstruct(%43, %43)
  %414 : int[] = prim::ListConstruct(%43, %43)
  %415 : int[] = prim::ListConstruct(%43, %43)
  %x.82 : Tensor = aten::conv2d(%out.170, %411, %412, %413, %414, %415, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/wrappers.py:106:12
  %417 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%410)
  %418 : bool = prim::requires_grad(%x.82)
  %out.171 : Tensor = prim::If(%418) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:45:8
    block0():
      %420 : Tensor = prim::GetAttr[name="weight"](%417)
      %421 : Tensor = prim::GetAttr[name="running_var"](%417)
      %422 : float = prim::GetAttr[name="eps"](%417)
      %423 : Tensor = aten::add(%421, %422, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %424 : Tensor = aten::rsqrt(%423) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:35
      %scale.159 : Tensor = aten::mul(%420, %424) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:48:20
      %426 : Tensor = prim::GetAttr[name="bias"](%417)
      %427 : Tensor = prim::GetAttr[name="running_mean"](%417)
      %428 : Tensor = aten::mul(%427, %scale.159) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:31
      %bias.159 : Tensor = aten::sub(%426, %428, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:49:19
      %430 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.160 : Tensor = aten::reshape(%scale.159, %430) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:50:20
      %432 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.160 : Tensor = aten::reshape(%bias.159, %432) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:51:19
      %out_dtype.80 : int = prim::dtype(%x.82)
      %435 : Tensor = aten::to(%scale.160, %out_dtype.80, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:23
      %436 : Tensor = aten::mul(%x.82, %435) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      %437 : Tensor = aten::to(%bias.160, %out_dtype.80, %44, %44, %53) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:45
      %438 : Tensor = aten::add(%436, %437, %43) # /home/arnab/anaconda3/envs/uos_mde/lib/python3.8/site-packages/detectron2/layers/batch_norm.py:53:19
      -> (%438)
    block1():
